<script setup>
import InfoMain from './InfoMain.vue';
import TextComponent from './TextComponent.vue';
import InfoSlider from './InfoSlider.vue';
import Header from '../Header/Header.vue';
import Footer from '../Footer/Footer.vue';

</script>

<template>

    <!-- разобраться со слайдером -->
    <!-- <Header /> -->

    <div class="container-xxl">
        <InfoMain/>

        <TextComponent>
            <template v-slot:title>
                Условия возврата
            </template>
            <template v-slot:text>
                <p class="">
                    Воспользоваться этими правами потребитель может только в случае, если ненадлежащее качество не было оговорено продавцов при покупке. Если при покупке товара отдельные недостатки были оговорены, это не лишает потребителя права предъявить претензии по поводу других обнаруженных недостатков.
        Если для установки выхода товара из строя требуется дополнительная проверка/экспертиза, она должна быть произведена в течение 20 дней с момента предъявления требований.
                </p>
                <p class="">
                    Если у продавца отсутствует необходимый товар, замена товара ненадлежащего качества должна быть произведена в течение месяца со дня предъявления требований.
        На время ремонта потребитель может потребовать безвозмездно предоставить ему аналогичный товар во временное пользование, если ремонт производится более 3 дней с момента подачи претензии.
                </p>
            </template>
        </TextComponent>

        <InfoSlider/>

        <TextComponent>
            <template v-slot:title>
                Как Вы можете вернуть товар?
            </template>

            <template v-slot:text>
                <p>
                    Если товар был оплачен банковской картой или через платежную систему WebMoney, Яндекс.Деньги и QIWI Кошелек, отмена операции по оплате товаров происходит в течение пяти рабочих дней с момента поступления заявления о возврате товара в письменном или электронном виде. Обратите внимание, что, в зависимости от вида платежной системы, возврат денежных средств на счет плательщика может занять до 30 дней. 
                </p>
                <ul>
                    <li>
                        консультирование покупателей, помощь в выборе товаров;
                    </li>
                    <li>
                        работа на кассе;
                    </li>
                    <li>
                        участие в выкладке товаров в торговом зале.
                    </li>
                </ul>
            </template>
        </TextComponent>
    </div>

    <Footer />

  
</template>

<style>

</style>